Tekla Open API Reference for Tekla Structures 2025
String Structure
 The String datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
[TypeConverterAttribute(typeof(StringConverter))]
public struct String : IXmlSerializable, IStringDataType,
	IDataType
<SerializableAttribute>
<TypeConverterAttribute(GetType(StringConverter))>
Public Structure String
	Implements IXmlSerializable, IStringDataType, IDataType
The String type exposes the following members.
Constructors
Name | Description
String
 Creates a new string datatype instance.
Top
Properties
Name | Description
Value
 The value of the string datatype.
Top
Methods
Name | Description
Equals
 Returns a value that indicates whether the current instance is equal to the given object.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Returns the hash code for the current instance.
 (Overrides ValueType.GetHashCode().)
GetSchema
 Gets the XML Schema for the datatype.
ReadXml
 Parses a new value from the given reader.
ToString
 Returns the string representation of the object.
 (Overrides ValueType.ToString().)
WriteXml
 Writes the value as XML to the given writer.
Top
Operators
Name | Description
Equality
 Compares a string value with a Datatype.String value.
Implicit(String to String)
 Converts from string to Datatype.String.
Implicit(String to String)
 Converts from Datatype.String to string.
Inequality
 Compares a string value with a Datatype.String value.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace